<?php

return [

    'config_title' =>'تكوين  مزود بوابة الرسائل النصية',
    'account_settings' =>'اعدادات حسابك',
    'username_column' =>'حقل اسم المستخدم',
    'username_value' =>'اسم المستخدم',
    'password_column' =>'حقل كلمة المرور',
    'password_value' =>'كلمة المرور',
    'api_settings' =>'اعدادات مزود خدمة الرسائل',
    'api_url' =>'رابط مزود الخدمة',
    'http_method' =>'طريقة الربط',
    'destination_attr' =>'اسم حقل المرسل اليه',
    'message_attr' =>'اسم حقل نص الرسالة',
    'success_code' =>'كود نجاح ارسال الرسالة',
    'use' =>'استخدام',
    'add_params' =>'بيانات اضافية',
    'parameter' =>'الحقل',
    'value' =>'القيمة',
    'save' =>'حفظ',
    'api_company' =>'مزود الخدمة',
    'erase' =>'مسح البيانات',
    'add' =>'اضافة',
    'delete' =>'حذف',
    'utf-8' =>' بعض مزودي الخدمة خاصة الداعمين للغة العربية قد يتطلب اسنخدام UTF-8 لضمان نجاح الارسال',


    'group_providers_title' => 'قائمة مزودي خدمة الرسائل الخاصة بالمجموعة',
    'user_providers_title' => 'قائمة مزودي خدمة الرسائل الخاصة بي',

    'group_trashed_providers_title' => 'قائمة سلة محذوفات مزودي خدمة الرسائل الخاصة بالمجموعة',
    'user_trashed_providers_title' => 'قائمة سلة محذوفات مزودي خدمة الرسائل الخاصة بي',


    'recover' => 'استرجاع',
    'setDefault' => 'افتراضي',
    'removeDefault' => 'الغاء كافتراضي',
    'trash' => 'سلة المحذوفات',
    'edit' => 'تعديل',
    'actions' => 'العمليات',
    'saved' => 'تم الحفظ بجاح',
    'error' => 'حدث خطأ حاول مرة اخري',

    'recover_error' => 'حدث خطأ اثناء استرجاع مزود الخدمة',
    'recover_success' => 'تم استرجاع مزود الخدمة من المحذوفات بنجاح',

    'set_default_success' => 'تم تحديث المزود الافتراضي بنجاح',
    'set_default_error' => 'حدث خطأ اثناء تحديث المزود الافتراضي',
 'remove_default_success' => 'تم ازالة المزود الافتراضي بنجاح',
    'remove_default_error' => 'حدث خطأ اثناء ازالة المزود الافتراضي',

    'delete-success' => 'تم اضافة مزود الخدمة ال سلة المحذوفات بنجاح',
    'delete-error' => 'حدث خطأ اثناء اضافة مزود الخدمة الي سلة المحذوفات',
    'destroy_success' => 'تم حذف مزود الخدمة نهائيا',
    'destroy_error' => 'حدث خطأ اثناء حذف مزود الخدمة نهائيا',


    'empty_info' => 'لا توجد بيانات لعرضها',

    'confirm' => 'تأكيد',
    'confirm_recover' => 'هل تريد استرجاع مزود الخدمة من سلة الحذوفات فعلا؟',
    'confirm_soft_delete' => 'هل تريد اضافة مزود الخدمة الي سلة الحذوفات فعلا؟',
    'confirm_set_default' => 'هل تريد تعيين مزود الخدمة كافتراضي؟',
    'confirm_remove_default' => 'هل تريد ازالة مزود الخدمة كافتراضي؟',
    'confirm_destroy' => 'هل تريد حذف مزود الخدمة نهائيا وكل المتعلقات والرسائل الخاصة به؟',


    'user' => 'المستخدم',
    'details' => 'التفاصيل',
    'date' => 'التاريخ',
    'track_group_title' => 'متابعة نشاط مستخدمي المجموعة',



];
